# Pandas

Pandas yra duomenų analizės biblioteka, sukurta NumPy pagrindu. Pandas yra pagrindinis įrankis Python aplinkoje, skirtas duomenų analizei, išvalymui ir paruošimui. Pandas pasižymi sparta ir produktyvumu. Galima dirbti su duomenimis iš įvairių šaltinių.

Pandas diegiasi *conda install pandas* arba *pip install pandas*

In [3]:
import numpy as np
import pandas as pd

# Serijos

Serijos (*Series*) yra smulkus pandas duomenų darinys, sukurtas ant NumPy array pagrindo.

In [4]:
labels = ['x', 'y', 'z']
data = [20, 30, 40]
pd.Series(data=data)

0    20
1    30
2    40
dtype: int64

Matyti, kad nuo įprastų masyvų, pandas serija skiriasi tuo, kad turi indeksaciją. Vienas iš parametrų, kuriuos galime perduoti kurdami seriją yra index.

In [5]:
pd.Series(data=data, index=labels)

x    20
y    30
z    40
dtype: int64

Pandas series galima kurti ir su python žodynais:

In [6]:
zodynas = {'x':20, 'y':30, 'z':40}
pd.Series(zodynas)

x    20
y    30
z    40
dtype: int64

**Reikšmės traukimas iš serijos**

In [9]:
serija = pd.Series([1,2,3,4,5], ['Vilnius', 'Kaunas', 'Klaipėda', 'Panevėžys', 'Šiauliai'])
# atkreipkite dėmesį, kad duomenis galima sudėti nebūtinai nurodant parametro pavadinimą.

In [8]:
serija

Vilnius      1
Kaunas       2
Klaipėda     3
Panevėžys    4
Šiauliai     5
dtype: int64

In [10]:
serija['Vilnius']

1

**Operacijos su serijomis**

In [17]:
serija2 = pd.Series([1,2,3,4,5], ['Vilnius', 'Kaunas', 'Lentvaris', 'Šiauliai', 'Klaipėda'])

In [18]:
serija2

Vilnius      1
Kaunas       2
Lentvaris    3
Šiauliai     4
Klaipėda     5
dtype: int64

naudojant sudėtį, pandas pagal galimybes bandys sumuoti reikšmes:

In [19]:
serija + serija2

Kaunas       4.0
Klaipėda     8.0
Lentvaris    NaN
Panevėžys    NaN
Vilnius      2.0
Šiauliai     9.0
dtype: float64

Ten, kur pandos negalėjo atlikti sudėties veiksmo, sugeneravo NaN - *not a number*. Tiek Pandas, tiek NumPy mėgsta integer reikšmes versti į float, kad išlaikytų kiek įmanoma tikslesnę informaciją.

# DataFrames

DataFrames yra pagrindinis pandas operacijų objektas. Jeigu norime susikurti naują DF, reikia į parametrus perduoti *data*, *index*, *columns*:

In [11]:
df = pd.DataFrame(np.random.rand(5,6), 
                  ['a', 'b', 'c', 'd', 'e'], 
                  ['U', 'V', 'W', 'X', 'Y', 'Z'])

In [12]:
df

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

Kiekvienas stulpelis yra pandas serija, jos tarpusavyje dalijasi indeksais (a, b, c, d, e), pvz.:

In [5]:
df['U']

a    0.361370
b    0.174726
c    0.605317
d    0.931402
e    0.113378
Name: U, dtype: float64

In [6]:
type(df['U'])

pandas.core.series.Series

**Jei norime daugiau stulpelių:**

In [9]:
df[['U', 'Y', 'Z']]

          U         Y         Z
a  0.361370  0.462288  0.504773
b  0.174726  0.128283  0.042082
c  0.605317  0.351447  0.072083
d  0.931402  0.232773  0.296398
e  0.113378  0.124420  0.666479

**Naujo stulpelio sukūrimas**

In [17]:
df['naujas'] = [1, 2, 3, 4, 5]

In [23]:
df

          U         V         W         X         Y         Z  naujas
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342       1
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547       2
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637       3
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333       4
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787       5

**Stulpelio ištrynimas**

In [25]:
df.drop('naujas', axis=1)

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

axis=0 reikštų, kad atliekame veiksmą su eilute. 1 tuo tarpu reiškia stulpelį.

In [26]:
df.drop('a', axis=0)

          U         V         W         X         Y         Z  naujas
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547       2
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637       3
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333       4
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787       5

In [27]:
df

          U         V         W         X         Y         Z  naujas
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342       1
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547       2
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637       3
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333       4
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787       5

**Inplace parametras**

paskutinis mūsų veiksmas originalaus šaltinio nepakeitė, jeigu dabar išsikviesime df, matysime, kad jis koks buvo, toks ir liko:

In [22]:
df

          U         V         W         X         Y         Z  naujas
a  0.361370  0.902063  0.702827  0.986880  0.462288  0.504773       1
b  0.174726  0.518000  0.119260  0.839525  0.128283  0.042082       2
c  0.605317  0.887836  0.094214  0.327027  0.351447  0.072083       3
d  0.931402  0.905410  0.531652  0.587163  0.232773  0.296398       4
e  0.113378  0.060269  0.325921  0.646713  0.124420  0.666479       5

norėdami pakeisti originalą, turime nurodyti parametrą inplace=True:

In [28]:
df.drop('naujas', axis=1, inplace=True)

In [29]:
df

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

*inplace* parametras apsaugo mus nuo netyčinio duomenų sugadinimo

**Pabandykime ištrinti eilutę:**

In [31]:
df.drop('e')

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333

In [32]:
df

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

trinant eilutę parametro axis=0 nurodyti nebūtina, tai yra *default* reikšmė

**Eilučių traukimas**

In [28]:
df.loc['e']

U    0.113378
V    0.060269
W    0.325921
X    0.646713
Y    0.124420
Z    0.666479
Name: e, dtype: float64

eilutes galime traukti ir pagal indeksą:

In [31]:
df.iloc[4]

U    0.113378
V    0.060269
W    0.325921
X    0.646713
Y    0.124420
Z    0.666479
Name: e, dtype: float64

**Subsets**

jeigu norime pavienės reikšmės iš lentelės:

In [33]:
df.loc['c', 'Z']

0.25363704647790075

jeigu norime fragmento iš eilučių ir stulpelių (*subset*):

In [35]:
df.loc[['a', 'c'], ['U', 'V', 'Z']]

          U         V         Z
a  0.152870  0.969675  0.301342
c  0.495006  0.660995  0.253637

**Duomenų traukimas pagal sąlygą:**

duomenų traukimas pagal sąlygą yra labai panašus, kaip ir numPy:

In [37]:
df

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

In [44]:
df[df>0.4]

          U         V         W         X         Y         Z
a       NaN  0.969675  0.480424       NaN  0.986391       NaN
b  0.457910       NaN       NaN       NaN  0.774033       NaN
c  0.495006  0.660995       NaN  0.699804  0.963157       NaN
d       NaN       NaN       NaN  0.883320  0.883029  0.857333
e       NaN  0.968331       NaN       NaN       NaN       NaN

kur reikšmės atitinką sąlygą, turime reikšmes, kur neatitinka - NaN.

jeigu prireiktų subset'o, kur stulpelio 'W' reikšmės yra > 0.5:

In [42]:
df[df['W']>0.4]

         U         V         W         X         Y         Z
a  0.15287  0.969675  0.480424  0.241586  0.986391  0.301342

Skirtumas tarp šių operacijų toks, kad kai sąlygą taikome visam DataFrame'ui, gauname tą patį DataFrame su NaN reikšmėmis, tose vietose, kur originalios reikšmės neatitinka sąlygos. Kai sąlygą taikome stulpeliams, gauname tik tas eilutes, kurios atitinka sąlygą, t.y. vykdome filtravimą.

**Užklausų kombinavimas**

In [47]:
df[df['W']>0.4][['U', 'W', 'Z']]

         U         W         Z
a  0.15287  0.480424  0.301342

šiame pavyzdyje gauname rezultatą, kokį gautumėm paeiliui ivykdę dvi atskiras eilutes: *df1 = df[df['W']>0.5], df1[['U', 'W', 'Z']]*. Užklausų kombinavimas leidžia mums nekurti atmintyje papildomų kintamųjų (kaip šiuo atveju *df1*).

**Sąlygų kombinavimas**

In [45]:
df

          U         V         W         X         Y         Z
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

In [50]:
df[(df['U']>0.4) & (df['Z']<0.4)]

          U         V         W         X         Y         Z
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637

gavome tas eilutes, kuriose U stulpelyje reikšmės didesnės, o Z stulpelyje mažesnės už 0.4.

In [52]:
df[(df['U']>0.4) & (df['Z']<0.4)][['U', 'Z']]

          U         Z
b  0.457910  0.274547
c  0.495006  0.253637

Čia sukombinavome dvi sąlygas ir iš rezultato paprašėme tik 2jų stulpelių

**Operacijos su index stulpeliu**

reset_index paverčia mūsų seną indeksą dar vienu stulpeliu, ir sukuria naują indeksą iš skaičių. Reikia naudoti *inplace=True*, jei norime pakeisti originalą.

In [53]:
df.reset_index()

  index         U         V         W         X         Y         Z
0     a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
1     b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
2     c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
3     d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
4     e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787

Norint sukurti naują indeksą, reikia pridėti naują stulpelį:

In [54]:
naujas_indeksas = 'Vilnius Kaunas Klaipėda Šiauliai Panevėžys'.split()

In [55]:
naujas_indeksas

['Vilnius', 'Kaunas', 'Klaipėda', 'Šiauliai', 'Panevėžys']

In [56]:
df['Miestai'] = naujas_indeksas

In [57]:
df

          U         V         W         X         Y         Z    Miestai
a  0.152870  0.969675  0.480424  0.241586  0.986391  0.301342    Vilnius
b  0.457910  0.233163  0.129411  0.143683  0.774033  0.274547     Kaunas
c  0.495006  0.660995  0.373867  0.699804  0.963157  0.253637   Klaipėda
d  0.000743  0.203814  0.257354  0.883320  0.883029  0.857333   Šiauliai
e  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787  Panevėžys

In [59]:
df.set_index('Miestai')

                  U         V         W         X         Y         Z
Miestai
Vilnius    0.152870  0.969675  0.480424  0.241586  0.986391  0.301342
Kaunas     0.457910  0.233163  0.129411  0.143683  0.774033  0.274547
Klaipėda   0.495006  0.660995  0.373867  0.699804  0.963157  0.253637
Šiauliai   0.000743  0.203814  0.257354  0.883320  0.883029  0.857333
Panevėžys  0.146380  0.968331  0.009328  0.046277  0.386115  0.076787